#coding: utf-8
"""CourtDataVisualization special topic module temporary data source

在此文件中定义一些经过一定处理的常量数据，以使由于特殊原因暂时不能实时获取处理的数据能够集中管理。
"""

temp_civil_case_cause = {
	'案外人执行异议之诉': 334, '保安服务合同纠纷': 4, '保险代理合同纠纷': 5, '保险纠纷': 267, '保险人代位求偿权纠纷': 94, '保证保险合同纠纷': 40,
	'被继承人债务清偿纠纷': 33, '变更扶养关系纠纷': 3, '变更抚养关系纠纷': 152, '殡葬服务合同纠纷': 1, '不明抛掷物、坠落物损害责任纠纷': 1, '不正当竞争纠纷': 15,
	'财产保险合同纠纷': 211, '财产损害赔偿纠纷': 851, '财产损失保险合同纠纷': 12, '产品生产者责任纠纷': 11, '产品销售者责任纠纷': 616, '产品责任纠纷': 1413,
	'车位纠纷': 8, '撤销婚姻纠纷': 1, '承包地征收补偿费用分配纠纷': 102, '出版合同纠纷': 2, '触电人身损害责任纠纷': 16, '代位继承纠纷': 1, '担保物权纠纷': 31,
	'担保物权确认纠纷': 2, '抵押权纠纷': 10, '地面施工、地下设施损害责任纠纷': 6, '电信服务合同纠纷': 241, '对外追收债权纠纷': 40, '法定继承纠纷': 356,
	'法律服务合同纠纷': 21, '返还原物纠纷': 598, '房地产咨询合同纠纷': 6, '房屋买卖合同纠纷': 1255, '分家析产纠纷': 160, '夫妻财产约定纠纷': 2, '扶养费纠纷': 35,
	'扶养纠纷': 8, '服务合同纠纷': 54, '福利待遇纠纷': 167, '抚养费纠纷': 276, '抚养纠纷': 32, '工伤保险待遇纠纷': 496, '公共场所管理人责任纠纷': 6,
	'公共道路妨碍通行损害责任纠纷': 10, '公司分立纠纷': 2, '公司解散纠纷': 29, '公司决议撤销纠纷': 13, '公司决议纠纷': 11, '公司决议效力确认纠纷': 23,
	'公司盈余分配纠纷': 20, '公司证照返还纠纷': 12, '公证损害责任纠纷': 9, '共有纠纷': 117, '共有权确认纠纷': 19, '共有人优先购买权纠纷': 2, '共有物分割纠纷': 147,
	'股东出资纠纷': 37, '股东损害公司债权人利益责任纠纷': 41, '股东知情权纠纷': 25, '股东资格确认纠纷': 180, '股票权利确认纠纷': 3, '股权转让纠纷': 438,
	'挂靠经营合同纠纷': 843, '合伙企业财产份额转让纠纷': 5, '合伙企业纠纷': 64, '恢复原状纠纷': 133, '婚姻家庭纠纷': 41, '婚姻无效纠纷': 13, '婚约财产纠纷': 24,
	'机动车交通事故责任纠纷': 5635, '技术服务合同纠纷': 12, '技术咨询合同纠纷': 4, '继承纠纷': 444, '家政服务合同纠纷': 2, '监护权纠纷': 7, '监护人责任纠纷': 12,
	'建设用地使用权纠纷': 8, '建筑物、构筑物倒塌损害责任纠纷': 6, '建筑物区分所有权纠纷': 70, '健康保险合同纠纷': 6, '教育机构责任纠纷': 12, '教育培训合同纠纷': 14,
	'解除收养关系纠纷': 9, '借款合同纠纷': 341, '金融借款合同纠纷': 1551, '金融衍生品种交易纠纷': 5, '经济补偿金纠纷': 473, '经济适用房转让合同纠纷': 3,
	'竞业限制纠纷': 3, '劳动合同纠纷': 1285, '劳动争议': 3398, '离婚后财产纠纷': 547, '离婚后损害责任纠纷': 6, '离婚纠纷': 4678, '联营合同纠纷': 62,
	'旅店服务合同纠纷': 6, '旅游合同纠纷': 7, '买卖合同纠纷': 1173, '民间借贷纠纷': 4657, '名誉权纠纷': 149, '农村房屋买卖合同纠纷': 18, '排除妨害纠纷': 469,
	'票据返还请求权纠纷': 2, '票据付款请求权纠纷': 12, '票据纠纷': 118, '票据利益返还请求权纠纷': 18, '票据损害责任纠纷': 2, '票据追索权纠纷': 5, '破产撤销权纠纷': 4,
	'破产债权确认纠纷': 3, '普通破产债权确认纠纷': 33, '期货交易纠纷': 3, '企业承包经营合同纠纷': 46, '企业出售合同纠纷': 17, '企业出资人权益确认纠纷': 10,
	'企业公司制改造合同纠纷': 2, '企业借贷纠纷': 17, '企业租赁经营合同纠纷': 10, '侵害集体经济组织成员权益纠纷': 213, '侵害其他著作财产权纠纷': 63,
	'侵害企业出资人权益纠纷': 8, '侵害企业名称（商号）权纠纷': 1, '侵害商标权纠纷': 206, '侵害商业秘密纠纷': 6, '侵害作品发表权纠纷': 20, '侵害作品放映权纠纷': 209,
	'侵害作品复制权纠纷': 12, '侵害作品信息网络传播权纠纷': 23, '侵害作品展览权纠纷': 1, '侵权责任纠纷': 247, '清算责任纠纷': 6, '请求变更公司登记纠纷': 9,
	'请求撤销个别清偿行为纠纷': 80, '请求公司收购股份纠纷': 1, '庆典服务合同纠纷': 1, '确认劳动关系纠纷': 477, '确认票据无效纠纷': 225, '人格权纠纷': 4,
	'人身保险合同纠纷': 146, '人身自由权纠纷': 1, '人事争议': 21, '人寿保险合同纠纷': 18, '荣誉权纠纷': 1, '赡养费纠纷': 219, '赡养纠纷': 198,
	'商标代理合同纠纷': 1, '商标权权属、侵权纠纷': 49, '商标权转让合同纠纷': 2, '商标使用许可合同纠纷': 3, '商品房委托代理销售合同纠纷': 3, '商品房销售合同纠纷': 2092,
	'商品房预售合同纠纷': 933, '商品房预约合同纠纷': 110, '社会保险纠纷': 145, '申请保全案件': 9, '申请变更监护人': 21, '申请撤销监护人资格': 11,
	'申请撤销宣告公民死亡': 11, '申请撤销宣告失踪': 1, '申请公示催告': 102, '申请公司清算': 12, '申请拍卖扣押船舶': 104, '申请破产和解': 1, '申请破产清算': 103,
	'申请破产重整': 25, '申请确定监护人': 19, '申请诉前财产保全': 1823, '申请为失踪人财产指定、变更代管人': 3, '申请宣告公民恢复完全民事行为能力': 7, '申请宣告公民失踪': 70,
	'申请宣告公民死亡': 289, '申请宣告公民无民事行为能力': 391, '申请宣告公民限制民事行为能力': 79, '申请支付令': 169, '申请执行人执行异议之诉': 462,
	'生命权、健康权、身体权纠纷': 2228, '生育保险待遇纠纷': 3, '失业保险待遇纠纷': 171, '收养关系纠纷': 5, '水污染责任纠纷': 38, '饲养动物损害责任纠纷': 47,
	'损害公司利益责任纠纷': 32, '损害股东利益责任纠纷': 25, '所有权纠纷': 274, '所有权确认纠纷': 380, '探望权纠纷': 32, '特许经营合同纠纷': 44,
	'提供劳务者受害责任纠纷': 823, '提供劳务者致害责任纠纷': 16, '同居关系纠纷': 18, '同居关系析产纠纷': 38, '同居关系子女抚养纠纷': 1776, '土地承包经营权继承纠纷': 4,
	'土地承包经营权纠纷': 286, '土地承包经营权确认纠纷': 31, '退伙纠纷': 18, '网络服务合同纠纷': 3, '网络购物合同纠纷': 4, '网络侵权责任纠纷': 6,
	'网络域名注册合同纠纷': 8, '违反安全保障义务责任纠纷': 94, '伪造、冒用产品质量标志纠纷': 64, '物件损害责任纠纷': 12, '物件脱落、坠落损害责任纠纷': 12,
	'物权保护纠纷': 303, '物权确认纠纷': 141, '物业服务合同纠纷': 9503, '相邻采光、日照纠纷': 1, '相邻关系纠纷': 194, '相邻损害防免关系纠纷': 16,
	'相邻通行纠纷': 8, '相邻土地、建筑物利用关系纠纷': 3, '相邻污染侵害纠纷': 1, '相邻用水、排水纠纷': 5, '肖像权纠纷': 16, '小额借款合同纠纷': 38, '新增资本认购纠纷': 7,
	'信托纠纷': 1, '姓名权纠纷': 11, '修理、重作、更换纠纷': 1, '虚假登记损害责任纠纷': 3, '养老保险待遇纠纷': 98, '业主撤销权纠纷': 11, '业主共有权纠纷': 25,
	'业主知情权纠纷': 8, '一般取回权纠纷': 3, '一般人格权纠纷': 43, '医疗保险待遇纠纷': 49, '医疗服务合同纠纷': 44, '医疗损害责任纠纷': 291, '遗失物返还纠纷': 4,
	'遗赠扶养协议纠纷': 7, '遗赠纠纷': 3, '遗嘱继承纠纷': 44, '义务帮工人受害责任纠纷': 18, '意外伤害保险合同纠纷': 47, '因申请诉前财产保全损害责任纠纷': 33,
	'因申请诉中财产保全损害责任纠纷': 10, '因申请先予执行损害责任纠纷': 2, '隐私权纠纷': 2, '用益物权纠纷': 5, '用益物权确认纠纷': 4, '邮寄服务合同纠纷': 1,
	'与公司有关的纠纷': 63, '与破产有关的纠纷': 2, '责任保险合同纠纷': 41, '宅基地使用权纠纷': 9, '占有排除妨害纠纷': 6, '占有物返还纠纷': 24, '占有物损害赔偿纠纷': 2,
	'证券纠纷': 8, '执行分配方案异议之诉': 18, '执行异议之诉': 7, '职工破产债权确认纠纷': 15, '质权纠纷': 1, '中外合作经营企业合同纠纷': 1, '仲裁程序中的财产保全': 60,
	'著作权合同纠纷': 8, '著作权权属、侵权纠纷': 409, '著作权权属纠纷': 105, '著作权许可使用合同纠纷': 2, '追索劳动报酬纠纷': 1959, '保管合同纠纷': 6,
	'保险费纠纷': 1, '保证合同纠纷': 7, '不当得利纠纷': 10, '财会服务合同纠纷': 1, '车辆租赁合同纠纷': 6, '承揽合同纠纷': 22, '储蓄存款合同纠纷': 1,
	'抵押合同纠纷': 1, '定金合同纠纷': 1, '定作合同纠纷': 1, '发明专利实施许可合同纠纷': 3, '房屋拆迁安置补偿合同纠纷': 36, '房屋租赁合同纠纷': 93, '仿冒纠纷': 1,
	'分期付款买卖合同纠纷': 2, '附义务赠与合同纠纷': 1, '高度危险活动损害责任纠纷': 2, '公路货物运输合同纠纷': 8, '公路旅客运输合同纠纷': 2, '公司设立纠纷': 2,
	'公司债券回购合同纠纷': 5, '供用电合同纠纷': 1, '供用水合同纠纷': 1, '股权质权纠纷': 1, '广告合同纠纷': 1, '合伙协议纠纷': 42, '合同、无因管理、不当得利纠纷': 1,
	'合同纠纷': 84, '合资、合作开发房地产合同纠纷': 7, '环境污染责任纠纷': 30, '计算机软件开发合同纠纷': 1, '计算机软件著作权许可使用合同纠纷': 1, '技术合同纠纷': 13,
	'技术合作开发合同纠纷': 2, '技术秘密许可使用合同纠纷': 1, '技术培训合同纠纷': 1, '技术委托开发合同纠纷': 2, '技术转让合同纠纷': 6, '加工合同纠纷': 3,
	'建设工程分包合同纠纷': 10, '建设工程合同纠纷': 18, '建设工程设计合同纠纷': 1, '建设工程施工合同纠纷': 148, '建设用地使用权出让合同纠纷': 3,
	'建设用地使用权转让合同纠纷': 2, '建筑设备租赁合同纠纷': 28, '借记卡纠纷': 1, '借用合同纠纷': 1, '金融不良债权追偿纠纷': 2, '居间合同纠纷': 5, '劳务合同纠纷': 68,
	'林木折断损害责任纠纷': 1, '林业承包合同纠纷': 5, '临时用地合同纠纷': 1, '农村建房施工合同纠纷': 4, '农村土地承包合同纠纷': 26, '农业承包合同纠纷': 4,
	'期货交易代理合同纠纷': 1, '企业股份合作制改造合同纠纷': 9, '企业兼并合同纠纷': 6, '侵害发明专利权纠纷': 15, '侵害计算机软件著作权纠纷': 16, '侵害技术秘密纠纷': 2,
	'侵害实用新型专利权纠纷': 24, '侵害外观设计专利权纠纷': 33, '侵害网络域名纠纷': 1, '请求确认人民调解协议效力': 43, '取回权纠纷': 1, '取水权纠纷': 1,
	'确认不侵害专利权纠纷': 3, '确认合同无效纠纷': 24, '确认合同效力纠纷': 9, '确认合同有效纠纷': 4, '确认收养关系纠纷': 3, '擅自使用他人企业名称、姓名纠纷': 1,
	'擅自使用知名商品特有名称、包装、装潢纠纷': 1, '商标权权属纠纷': 4, '商业诋毁纠纷': 2, '商业贿赂不正当竞争纠纷': 2, '申请撤销仲裁裁决': 2, '申请确认仲裁协议效力': 6,
	'申请诉前证据保全': 1, '申请诉中财产保全': 8, '申请诉中证据保全': 1, '诉讼、仲裁、人民调解代理合同纠纷': 4, '土地承包经营权出租合同纠纷': 23, '土地承包经营权互换合同纠纷': 1,
	'土地承包经营权转包合同纠纷': 5, '土地承包经营权转让合同纠纷': 6, '土地租赁合同纠纷': 3, '土壤污染责任纠纷': 2, '网络域名权属纠纷': 1, '委托创作合同纠纷': 3,
	'委托合同纠纷': 9, '物权纠纷': 2, '乡镇企业承包经营合同纠纷': 2, '信用卡纠纷': 14, '信用证纠纷': 1, '信用证开证纠纷': 1, '修理合同纠纷': 3, '虚假宣传纠纷': 4,
	'医疗产品责任纠纷': 2, '因恶意提起知识产权诉讼损害责任纠纷': 1, '用人单位责任纠纷': 4, '渔业承包合同纠纷': 2, '与企业有关的纠纷': 1, '运输合同纠纷': 3,
	'噪声污染责任纠纷': 2, '赠与合同纠纷': 6, '债权人撤销权纠纷': 7, '债权人代位权纠纷': 1, '债权债务概括转移合同纠纷': 1, '债权转让合同纠纷': 8, '债务转移合同纠纷': 1,
	'占有保护纠纷': 1, '招标投标买卖合同纠纷': 1, '证券虚假陈述责任纠纷': 3, '知识产权合同纠纷': 1, '职务发明创造发明人、设计人奖励、报酬纠纷': 4, '植物新品种实施许可合同纠纷': 1,
	'质押式证券回购纠纷': 2, '中外合资经营企业合同纠纷': 1, '种植、养殖回收合同纠纷': 1, '专利合同纠纷': 2, '专利权权属、侵权纠纷': 48, '专利权权属纠纷': 13,
	'专利权转让合同纠纷': 1, '专利申请权转让合同纠纷': 3, '装饰装修合同纠纷': 14, '追偿权纠纷': 70, '追收未缴出资纠纷': 3, '租赁合同纠纷': 53
}


temp_civil_case_region_distribution = [
	{'name': '合川区', 'value': 23940}, {'name': '渝中区', 'value': 8514}, {'name': '北碚区', 'value': 15363},
	{'name': '渝北区', 'value': 6386}, {'name': '涪陵区', 'value': 5930}, {'name': '万州区', 'value': 6501}
]

temp_civil_case_annual_number = [
	['2005年', '2006年', '2007年', '2008年', '2009年', '2010年', '2011年', '2012年', '2013年', '2014年', '2015年', '2016年', '2017年', '2018年', '2019年'],
	{
		'name': '民事案件',
		'data': [31, 27, 14, 52, 226, 83, 461, 379, 1079, 8598, 10822, 11803, 14055, 17313, 1677],
	}
]

temp_criminal_case_cause = {
    '交通肇事罪': 344, '危险驾驶罪': 1415, '非法制造、买卖、运输、邮寄、储存枪支、弹药、爆炸物罪': 1161, '以危险方法危害公共安全罪': 13, '重大责任事故罪': 5,
    '危险驾驶罪、危害公共安全罪': 2, '非法持有、私藏枪支、弹药罪': 21, '过失以危险方法危害公共安全罪': 6, '投放危险物质罪': 1, '放火罪': 17,
    '非法制造、买卖、运输、邮寄、储存枪支、弹药、爆炸物罪、交通肇事罪': 1, '破坏电力设备罪': 6, '失火罪': 6, '过失投放危险物质罪': 1,
    '生产、销售假药罪、非法制造、买卖、运输、邮寄、储存枪支、弹药、爆炸物罪': 1, '破坏广播电视设施、公用电信设施罪': 2, '故意伤害罪': 663, '非法拘禁罪': 89,
    '过失致人死亡罪': 61, '强奸罪': 57, '重婚罪': 75, '出售、非法提供公民个人信息罪': 11, '故意杀人罪': 761, '拐卖妇女、儿童罪': 3, '非法获取公民个人信息罪': 20,
    '过失致人重伤罪': 4, '遗弃罪': 1, '强制猥亵、侮辱妇女罪': 6, '诈骗罪': 339, '盗窃罪': 2526, '抢劫罪': 244, '抢夺罪': 44, '盗窃罪、抢劫罪': 1, '故意毁坏财物罪': 25,
    '敲诈勒索罪': 17, '挪用资金罪': 12, '破坏生产经营罪': 2, '侵占罪': 8, '盗窃罪、抢劫罪、抢夺罪': 2, '赌博罪、盗窃罪、强奸罪、抢劫罪': 1, '盗窃罪、抢夺罪': 2, '职务侵占罪': 41,
    '滥伐林木罪': 176, '非法捕捞水产品罪': 288, '容留他人吸毒罪': 610, '非法持有毒品罪': 264, '开设赌场罪': 100, '引诱、容留、介绍卖淫罪': 78, '走私、贩卖、运输、制造毒品罪': 1664,
    '组织、利用会道门、邪教组织、利用迷信破坏法律实施罪': 6, '聚众斗殴罪': 44, '伪造、变造、买卖国家机关公文、证件、印章罪': 12, '寻衅滋事罪': 176, '制作、复制、出版、贩卖、传播淫秽物品牟利罪': 7,
    '非法收购、运输、加工、出售国家重点保护植物、国家重点保护植物制品罪': 3, '妨害公务罪': 53, '招摇撞骗罪': 8, '盗伐林木罪': 38, '非法收购、运输盗伐、滥伐的林木罪': 8,
    '走私、贩卖、运输、制造毒品罪、容留他人吸毒罪': 3, '非法猎捕、杀害珍贵、濒危野生动物罪': 16, '组织卖淫罪': 3, '非法占用农用地罪': 19, '走私、贩卖、运输、制造毒品罪、非法持有毒品罪': 2,
    '偷越国（边）境罪': 7, '传播淫秽物品罪': 3, '非法狩猎罪': 12, '非法获取计算机信息系统数据、非法控制计算机信息系统罪': 3, '非法行医罪': 4, '非法处置查封、扣押、冻结的财产罪': 4,
    '盗掘古文化遗址、古墓葬罪': 1, '伪造公司、企业、事业单位、人民团体印章罪': 9, '非法采矿罪': 10, '窝藏、转移、隐瞒毒品、毒赃罪': 3, '掩饰、隐瞒犯罪': 43, '赌博罪': 14,
    '非法采伐、毁坏国家重点保护植物罪': 8, '妨害动植物防疫、检疫罪': 2, '故意伤害罪、故意毁坏财物罪、寻衅滋事罪、非法持有毒品罪': 1, '脱逃罪': 1, '非法种植毒品原植物罪': 1,
    '使用虚假身份证件、盗用身份证件罪': 2, '受贿罪': 125, '行贿罪': 22, '贪污罪': 26, '单位行贿罪': 5, '挪用公款罪': 11, '介绍贿赂罪': 1, '单位受贿罪': 1, '拒不支付劳动报酬罪': 4,
    '盗窃罪、抢劫罪、脱逃罪、抢夺罪': 1, '危险驾驶罪、抢劫罪': 1, '非法侵入住宅罪': 4, '诽谤罪': 4, '信用卡诈骗罪、诈骗罪': 1, '危险驾驶罪、非法制造、买卖、运输、邮寄、储存枪支、弹药、爆炸物罪': 2,
    '猥亵儿童罪': 4, '扰乱无线电通讯管理秩序罪': 1, '拒不执行判决、裁定罪': 5, '非法收购、运输、出售珍贵、濒危野生动物、珍贵、濒危野生动物制品罪': 1, '伪造、变造居民身份证罪': 1,
    '重大劳动安全事故罪': 1, '爆炸罪、非法制造、买卖、运输、邮寄、储存枪支、弹药、爆炸物罪、非法持有、私藏枪支、弹药罪': 3, '诈骗罪、非法制造、买卖、运输、邮寄、储存枪支、弹药、爆炸物罪': 1,
    '打击报复证人罪': 1, '盗窃罪、走私、贩卖、运输、制造毒品罪': 2, '窝藏、包庇罪': 3, '破坏计算机信息系统罪': 1, '传播性病罪': 1, '组织他人偷越国（边）境罪': 1, '破坏监管秩序罪': 2,
    '侮辱罪': 7, '绑架罪': 3, '私分国有资产罪': 2, '抢劫罪、非法拘禁罪': 1, '刑讯逼供罪': 2, '组织、领导、参加恐怖组织罪': 1, '组织、领导、参加黑社会性质组织罪': 38,
    '非法制造、买卖、运输、邮寄、储存枪支、弹药、爆炸物罪、走私、贩卖、运输、制造毒品罪': 1, '强迫卖淫罪': 1, '帮助毁灭、伪造证据罪': 1, '盗窃、侮辱尸体罪': 1, '故意伤害罪、妨害公务罪': 1, '单位行贿罪、行贿罪': 1, '侵占罪、职务侵占罪': 1
}

temp_criminal_case_region_distribution = [
    {'name': '万州区', 'value': 3064}, {'name': '北碚区', 'value': 1456}, {'name': '涪陵区', 'value': 2238},
    {'name': '渝中区', 'value': 2558}, {'name': '渝北区', 'value': 2704}
]

temp_criminal_case_annual_number = [
    ['2005年', '2006年', '2007年', '2008年', '2009年', '2010年', '2011年', '2012年', '2013年', '2014年', '2015年', '2016年', '2017年', '2018年', '2019年'],
    {
		'name': '刑事案件',
		'data': [7, 1, 4, 6, 5, 67, 72, 226, 1743, 2134, 2347, 2507, 2614, 269],
	}
]

temp_administrative_case_cause = {
    '信息电讯行政管理(信息、电讯)': 460, '民政行政管理(民政)、行政登记': 1, '民政行政管理(民政)': 1205, '其他(公安)': 249, '道路交通管理(道路)': 28, '公安行政管理:其他(公安)': 118,
    '公安行政管理:消防管理(消防)': 1, '治安管理(治安)': 59, '公安行政管理:道路交通管理(道路)': 13, '土地行政管理(土地)': 754, '其他(资源)': 664, '林业行政管理(林业)': 107,
    '资源行政管理:其他(资源)': 474, '资源行政管理:林业行政管理(林业)': 107, '资源行政管理:土地行政管理(土地)': 488, '公安行政管理:治安管理(治安)': 73,
    '城乡建设行政管理:房屋登记管理(房屋登记)': 110, '房屋拆迁管理(拆迁)': 325, '城市规划管理(规划)': 56, '房屋登记管理(房屋登记)': 62, '城乡建设行政管理:城市规划管理(规划)': 48,
    '其他(城建)': 11, '城乡建设行政管理:房屋拆迁管理(拆迁)': 114, '消防管理(消防)': 6, '城乡建设行政管理:其他(城建)': 14, '城乡建设行政管理': 1, '地质矿产行政管理(地矿)': 4,
    '资源行政管理:地质矿产行政管理(地矿)': 6,  '资源行政管理:能源行政管理(能源管理)': 2
}

temp_administrative_case_region_distribution = [
    {'name': '万州区', 'value': 511}, {'name': '北碚区', 'value': 331}, {'name': '涪陵区', 'value': 989},
    {'name': '渝中区', 'value': 816}, {'name': '渝北区', 'value': 2913}
]

temp_administrative_case_annual_number = [
    ['2005年', '2006年', '2007年', '2008年', '2009年', '2010年', '2011年', '2012年', '2013年', '2014年', '2015年', '2016年', '2017年', '2018年', '2019年'],
    {
		'name': '行政案件',
		'data': [0, 0, 0, 1, 7, 19, 18, 95, 614, 977, 1453, 1192, 1126, 50],
	}
]

temp_divorce_dispute_party_education = [
    {'name': '文盲','y': 12144}, {'name': '小学','y': 8243}, {'name': '初中','y': 3424}, 
    {'name': '高中','y': 3054}, {'name': '本科','y': 6424}, {'name': '硕士','y': 1054}, 
    {'name': '博士及以上','y': 200}
]

temp_divorce_dispute_party_vocation = [
    ['无业游民', '工人', '自营业主', '教师', '医生', '农民'],
    [420, 330, 340, 390, 520, 750]
]